{
	"BR": "",
	"CN": "",
	"CZ": "",
	"DA": "",
	"DE": "(1) Sie sind als Nutzer fur alle ihre Handlungen, die Sie im Zusammenhang mit der Nutzung des Internets uber unseren Hotspot vornehmen, selbst verantwortlich. Dies gilt auch dann, wenn Handlungen etwa uber die von Ihnen angegebenen E-Mail-Adresse und/oder Ihr Endgerat von Dritten begangen werden.\n(2) Sie stellen uns von samtlichen Forderungen, die Dritte gegen uns wegen eines Versto-ses des Nutzers gegen gesetzliche Vorschriften, gegen Rechte Dritter (insbesondere Per-sonlichkeits-, Urheber- und Markenrechte) oder gegen vertragliche Pflichten, Zusicherun-gen oder Garantien geltend machen, einschlieslich der Kosten der notwendigen Rechts-verteidigung (Rechtsanwalts- und Gerichtskosten in gesetzlicher Hohe) auf erstes Anfor-dern frei.\n(3) Sie sind verpflichtet, im Falle der Geltendmachung von Anspruchen im Sinne von vor-stehendem Absatz 2 unverzuglich und vollstandig bei der Sachverhaltsaufklarung mitzuwir-ken und uns die hierzu erforderlichen Angaben in geeigneter Weise zuganglich zu machen.\nDurch die Nutzung des Hotspots erkennen Sie hiermit ausdrucklich an, dass durch die Ubertragung von Informationen uber das Internet Sicherheits-, Datenschutz- und Vertraulichkeitsrisiken verbunden sind. Das ist unabhangig davon, ob die Verbindung uber eine drahtgebundene oder drahtlose Technologie hergestellt wird. Zu den Sicherheitsproblemen gehoren unter anderem das Abfangen von Informationen, der Verlust von Daten sowie die Infizierung mit Viren und anderen Programmen, die Ihren Computer beschadigen konnen.\nDementsprechend erklaren Sie sich damit einverstanden, dass der Besitzer und/oder Provider dieses Netzes NICHT fur das Abfangen von Daten, Computerwurmern oder -Viren, den Verlust von Daten, die Beschadigung von Dateien, das Hacken oder die Beschadigung Ihres Computers oder anderer Gerate haftet, die durch die Ubertragung oder das Herunterladen von Informationen oder Materialien uber den bereitgestellten Internetdienst entstehen.\nDie Nutzung des drahtlosen Netzwerks unterliegt den unten aufgefuhrten allgemeinen Beschrankungen. Wird abnormales, illegales oder unbefugtes Verhalten festgestellt, einschlieslich eines hohen Bandbreitenverbrauchs, behalt sich der Netzbetreiber das Recht vor, das betreffende Gerat dauerhaft vom drahtlosen Netz zu trennen",
	"EN": "Welcome to our Wi-Fi service (the \"Service\"). By accessing and using this Service, you represent and acknowledge that you are of legal age, and you have read and agree to be bound by the following terms and conditions:\n1. Accessing the Service\n1.1 The Service is provided by the store (the \"Store\") for your personal use. The Store reserves the right to change or terminate the Service or change this Terms and Conditions at any time. You are responsible for reviewing this Terms and Conditions each time you use the Service.\n1.2 Access to the Service may be blocked, suspended or terminated at any time for any reason including but not limited to your violation of this Terms and Conditions or applicable laws.\n1.3 The Store does not guarantee availability to the Internet, the minimum Internet connection speeds on the network, or that the Service will be stable, fault-free, timely, reliable, operational or suitable for supporting your intended use.\n1.4 The Store does not guarantee the quality of the information on the internet. It is your responsibility to determine the validity, quality, and relevance of the information obtained.\n1.5 The Service is provided on an open and public basis and the Store cannot guarantee the security of the Wi-Fi service, you acknowledge and agree that there are inherent security risks associated with using the Service and that you do so solely at your own risk.\n2. Restrictions\nYou acknowledge and agree that when using the Service you will comply with all applicable laws and that you will not;\na. use the Service for commercial purposes;\nb. use the Service to send unsolicited bulk emails;\nc. reveal or publish proprietary or confidential information;\nd. infringe the intellectual property rights of any person;\ne. collect or harvest any information or data from the Service or the servers used to provide the Service;\nf. attempt to intercept, interfere with or decipher any transmission to or from the servers used to provide the Service;\ng. connect to \"Peer to Peer\" file sharing networks, download large files, or run any programs, services, systems, processes, or servers that may substantially degrade network performance or accessibility;\nh. use the Service to transmit, send, upload, receive, download, publish, post, distribute, disseminate, encourage or solicit receipt of any material which is abusive, defamatory, harassing, indecent, offensive, obscene, menacing, racist, pornographic, threatening, unlawful or in breach of any right of any person;\ni. use the Service to transmit, store, publish or upload any electronic material, such as viruses, malware, Trojan horses, worms ,or time bombs, which will or are likely to cause damage to, or to destroy or limit the functionality of, any computer, software, hardware, electronic device or telecommunications equipment;\nj. obtain unauthorised access to any other person's computer, email account, bank account, computer network or equipment; or\nk. use the Service to invade the privacy of another person or to cause annoyance, inconvenience or anxiety to another person.\n3. Privacy\nYou acknowledge and agree that the Service will capture and process information about the web browser type and/or operating system information used by the enabled device to determine the more effective and/or customized means of displaying the requested website on your device. And the Store will collect the IP and MAC address of the enabled device that has accessed the Wi-Fi service, once the Terms and Conditions have been agreed to.\n4. Release and Indemnity\n4.1 The Store is not liable for loss of data due to service delays or interruptions or any kind of loss or damages you may sustain as a result of your use of the Service.\n4.2 You release and discharge the Store from any liability which might arise from your use of the Service, including liability in relation to defamatory or offensive material or any breach of copyright which may occur.\n4.3 You agree to indemnify and must defend and hold harmless the Store, its employees and agents, from and against all loss, damage, liability, charge, expense (including but not limited to attorneys' fees) of any nature or kind arising from your breach of these Terms and Conditions.",
	"ES": "",
	"FI": "",
	"FR": "",
	"HU": "",
	"IT": "",
	"JP": "",
	"KR": "",
	"MS": "",
	"NL": "",
	"NO": "",
	"PL": "",
	"RO": "",
	"RU": "",
	"SL": "",
	"SV": "",
	"TH": "",
	"TR": "",
	"TW": "歡迎您使用我們的Wi-Fi服務（以下簡稱「本服務」）。當您訪問和使用本服務時，您聲明並承認您已達到法定年齡，且您已閱讀並同意受以下條款的約束：\n1.訪問本服務\n1.1 本服務由商店（以下簡稱「本商店」）提供給您個人使用，本商店保留隨時更改或終止本服務或更改本使用條款的權利。您有責任於每次使用本服務時閱讀本使用條款。\n1.2 本服務可能隨時因任何原因被阻擋、暫停或終止，包括但不限於您違反本使用條款或所需適用的法律。\n1.3 本商店不對網路的可用性和最低連接速度作任何保證，也不保證本服務將穩定、無故障、及時、可靠、可運行或能符合或支持您的預期用途。\n1.4 本商店不對網路上的資訊品質作任何保證，您應自行判斷這些資訊的有效性、品質和關聯性。\n1.5 本服務是以公開的方式提供，本商店無法保證Wi-Fi服務的安全性，您知悉並同意使用本服務存在既有的安全風險，此風險由您自行承擔。\n2. 限制\n您知悉並同意在使用本服務時會遵守所有適用的法律，並且您不會;\na. 將本服務用於商業目的;\nb. 使用本服務發送未經請求的廣告郵件;\nc. 洩露或公開他人專有或機密性的資訊;\nd. 侵害任何人的智慧財產權;\ne. 從本服務或用於提供本服務的伺服器中蒐集或擷取任何資訊或數據;\nf. 試圖攔截、干擾或解碼任何用於提供本服務的伺服器傳輸;\ng. 連接至點對點共享網站、下載大量文件或運行任何可能嚴重降低網路效能或使用性的程式、服務、系統、程序或伺服器;\nh. 使用本服務傳輸、發送、上傳、接收、下載、發布、張貼、分發、傳播、鼓勵或徵求任何包含辱罵、誹謗、騷擾、不雅、攻擊性、淫穢、威脅、種族主義、色情的、威脅、非法或侵害他人權利的內容;\ni. 使用本服務傳輸、儲存、發布或上傳任何可能損害、破壞或限制任何電腦、軟體、硬體、電子設備或電信設備功能的電子檔案，例如病毒、惡意軟體、特洛伊木馬、蠕蟲或病毒炸彈;\nj. 未經授權訪問任何其他人的電腦、電子郵件帳戶、銀行帳戶、電腦網路或設備;或使用本服務以侵犯他人隱私或為用於對他人造成困擾、不便或焦慮。\n3. 隱私\n您知悉並同意，本服務將取得並處理關於連接設備的網絡瀏覽器類型和/或作業系統資訊，以判斷較有效率及/或適合您設備的網站顯示方式。而本商店將在本使用條款經同意後蒐集連線Wi-Fi的裝置IP和MAC位置。\n4. 免責與賠償條款 \n本商店不對因本服務延遲或中斷而導致的數據遺失，或您因使用本服務可能遭受的任何損失或損害承擔任何責任。\n您免除本商店因您使用本服務而可能產生的任何責任，包括與誹謗或冒犯內容相關的責任，或可能發生的任何侵害著作權的責任。\n您同意對任何因您違反本使用條款而對本商店、其員工或代理人產生的所有損失、損害、責任、費用、支出（包含但不限於律師費等）進行賠償及辯護。",
	"UK": ""
}